backend/app/controllers/projects_controller.rb

    def update
        project = Project.find(params[:id])
        project.update(name: params[:name], description: params[:description])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]
UPDATE "projects" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["name", "project 1"], ["description", "project stuff"], ["updated_at", "2020-10-23 07:54:53.058984"], ["id", 21]]