backend/app/controllers/skills_controller.rb

    def update
        skill = Skill.find(params[:id])
        skill.update(name: params[:name], description: params[:description])
---
SELECT "skills".* FROM "skills" WHERE "skills"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "skills" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "skills"."id" = ?  [["name", "ruby"], ["description", "learned ruby in the flatiron school"], ["updated_at", "2020-10-23 13:34:16.228238"], ["id", 10]]