backend/app/controllers/users_controller.rb

    def create
        user = User.new(first_name: params[:first_name], last_name: params[:last_name], username: params[:username], password: params[:password])
        if user.save
---
INSERT INTO "users" ("first_name", "last_name", "created_at", "updated_at", "username", "password_digest") VALUES (?, ?, ?, ?, ?, ?)