backend/app/controllers/users_controller.rb

    def show
        user = User.find_by(username: params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "tom"], ["LIMIT", 1]]

    def create

        user = User.new(first_name: params[:first_name], last_name: params[:last_name], username: params[:username], password: params[:password])
        user.image = "https://www.likemind.media/wp-content/uploads/2017/06/Profile-Photo.png"

        user.html = "<div class='card' style='width: 300px;'>
        <div class='name'>
            #{user.first_name} #{user.last_name}
        </div>
        <img src=#{user.image}>
        <div class='card-section'>
            <h4 class='status-name skill-name'>Status header</h4>
            <p  class='status-description skill-description'>Status description</p>
        </div>
        <span class= 'buttonIcon' id='b3'><i class='far fa-edit profile-edit'></i></span>
    </div>"

        if user.save

            6.times do

                skill = Skill.create(name: "Edit name", description: "Edit content", user_id: user.id)
                project = Project.create(name: "Edit name", description: "Edit content", user_id: user.id)
---
INSERT INTO "users" ("first_name", "last_name", "created_at", "updated_at", "username", "password_digest", "image", "html") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "skills" ("name", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Edit name"], ["description", "Edit content"], ["user_id", 12], ["created_at", "2020-10-23 19:06:58.575508"], ["updated_at", "2020-10-23 19:06:58.575508"]]
INSERT INTO "projects" ("name", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Edit name"], ["description", "Edit content"], ["user_id", 12], ["created_at", "2020-10-23 19:06:58.580898"], ["updated_at", "2020-10-23 19:06:58.580898"]]

    def login

        user = User.find_by(username: params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "bob"], ["LIMIT", 1]]